test/dummy/app/controllers/posts_controller.rb

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Updated Title"], ["updated_at", "2025-12-10 20:03:00.101146"], ["id", 1]]

    def set_post
      @post = Post.find(params.expect(:id))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]