test/dummy/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "created_at", "updated_at") VALUES ('orzo', '2025-12-10 19:44:11.569226', '2025-12-10 19:44:11.569226') RETURNING "id"

    def set_post
      @post = Post.find(params.expect(:id))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1